{
  "contact": {
    "name": "Cameron Monesmith",
    "email": "chmonesmith@gmail.com",
    "phone": "(440) 552-8334",
    "linkedin": "linkedin.com/in/cameron-monesmith/",
    "github": ""
  },
  "summary": "Recent graduate with a B.S. in Business Administration (Business Analytics and Information Systems) and a minor in Computer Science. Experienced in business analysis and product management through internships at Fidelity Investments. Skilled in leveraging data with SQL, Python, and Power BI to drive efficiency and product decisions. Seeking a Product Manager role to apply a blend of technical skills and business acumen.",
  "experience": [
    {
      "title": "Business Analyst",
      "company": "Fidelity Investments",
      "location": "Boston, MA",
      "dates": "May 2024 – Present",
      "bullet_points": [
        "Leveraged business intelligence tools including SQL, Excel VBA, Power Automate, and Python scripts to automate 10+ daily data processing and validation tasks, reducing manual workload by 25+ hours and improving overall process efficiency by 40%",
        "Contributed to a 12-member Scrum team by providing project management to deliver a Python-based ML model that streamlined recurring fund accounting tasks, reducing effort per task by ~60% and saving ~1 hour per employee across 100+ users",
        "Designed Power BI dashboards in collaboration with auditors and product stakeholders to track performance metrics, improving data clarity by 35% and accelerating decision-making time by 20%"
      ]
    },
    {
      "title": "Product Management Intern",
      "company": "Fidelity Investments",
      "location": "Boston, MA",
      "dates": "May 2023 – August 2024",
      "bullet_points": [
        "Collaborated cross-functionally to gather requirements and define product KPIs (e.g., user engagement); designed and launched a Tableau dashboard that increased visibility into product health metrics by 50%",
        "Conducted competitive analysis and user research on task systems, synthesizing findings into strategic insights that supported the advancement of a new product initiative through executive design review",
        "Contributed to sprint planning, authored and updated user stories, and partnered with QA team to refine quality assurance criteria"
      ]
    },
    {
      "title": "Business Analyst Intern",
      "company": "Waypoint – SaaS Startup",
      "location": "Dublin, Ireland",
      "dates": "May 2022 – August 2022",
      "bullet_points": [
        "Executed market analysis by benchmarking 20+ university innovation hubs, performing gap analysis to identify outreach strategies, and developed data-driven business cases to present to the CEO for an early-stage SaaS company",
        "Designed and presented a marketing plan to the CEO, targeting high-priority organizations and increasing qualified lead conversion by 30%",
        "Used Python tools (Pandas, NumPy, Matplotlib) for statistical analysis, data mining, and trend analysis of lead quality, budget, and conversion metrics, enabling data-driven prioritization of high-value customer segments"
      ]
    },
    {
      "title": "Operations Analyst Intern",
      "company": "Benesch Law Firm",
      "location": "Cleveland, OH",
      "dates": "May 2021 – August 2021",
      "bullet_points": [
        "Spearheaded a multi-year risk management initiative, designing and implementing a project to reduce risk and improve operations by digitizing physical files and customizing image recognition software to make content searchable"
      ]
    },
    {
      "title": "Software Engineer",
      "company": "Target PC",
      "location": "Cleveland, OH",
      "dates": "May 2019 – August 2019",
      "bullet_points": [
        "Automated critical workflows with custom Java algorithms and a UI tool, converting 150-200 hours of quarterly manual effort into seconds of processing time"
      ]
    }
  ],
  "education": [
    {
      "degree": "Bachelor of Science in Business Administration - Dual Focus: Business Analytics & Information Systems, Minor: Computer Science",
      "university": "Boston University",
      "location": "Boston, MA",
      "graduation_date": "May 2024"
    }
  ],
  "skills": {
    "Product & Agile Tools": [
      "PSM I (Scrum.org)",
      "Jira",
      "Confluence",
      "Trello",
      "Figma",
      "Git",
      "User Stories",
      "MVP Planning",
      "Data Product Strategy"
    ],
    "Data & Visualization": [
      "Power BI",
      "Tableau",
      "Google Analytics",
      "Monte Carlo Simulations",
      "Financial Modeling"
    ],
    "Technical & Analytics": [
      "Python (Pandas, NumPy, Matplotlib)",
      "SQL (PostgreSQL)",
      "R",
      "Excel (VBA)",
      "Java",
      "AWS (S3, EC2)",
      "GCP (BigQuery)",
      "Power Automate",
      "Selenium",
      "Postman",
      "Swagger/OpenAPI"
    ]
  },
  "projects": [
    {
      "name": "Vice President of Student Affairs, Questrom Student Government",
      "description": "Raised $15K+ through external partnerships, led strategic planning and execution for 10+ campus-wide events for the Class of 2024.",
      "technologies": [
        "Leadership",
        "Event Planning",
        "Fundraising"
      ],
      "link": ""
    },
    {
      "name": "Cross-Functional CORE Project",
      "description": "Led product definition and business modeling as product owner, collaborating cross-functionally to deliver a full business case. Developed a dynamic financial model using advanced Excel for cost-benefit analysis, forecasting operational logistics, inventory, and expenses. Performed statistical analysis and Monte Carlo simulations to conduct robust risk analysis on financial projections, improving the accuracy and feasibility of the product's business plan.",
      "technologies": [
        "Excel (Financial Modeling)",
        "SWOT Analysis",
        "Risk Analysis",
        "Monte Carlo Simulation"
      ],
      "link": ""
    }
  ]
}